
<table width='100%'>
  <tr>
    <td>
      <div class='pagebar'>
        <span class='pageindex'>
          2 / 7        </span>
        <span class='pagelink'>
          <a href="02-lenguaje-php-ejer.html">[&lArr;]</a>
        </span>
        <span class='pagelink'>
          <a href="page-02.html">[&rArr;]</a>
        </span>
      </div>
    </td>
  </tr>
  <tr height="99%" valign="top">
    <td>
    <!-- BEGIN CONTENTS -->

<a name="h1_3"></a>
<h1>Marcas de inserci&oacute;n de c&oacute;digo PHP</h1>
<p>Se pretende probar el conjunto de marcas de inserci&oacute;n de c&oacute;digo PHP que est&aacute;n activas en la configuraci&oacute;n del equipo de pr&aacute;cticas.</p>

<table class='box'>
  <tr valign='top'>
    <td><img src="../../images/icons/edit.png"></td>
    <td width='99%'>
      <p>Editar el fichero <tt>Sites/cursophp/02-lenguaje-php/ficheros/prueba.php</tt> para que imprima varios mensajes de saludo utilizando la sentencia <tt>echo</tt>. Cada mensaje de saludo deber&aacute; utilizar una de las diferentes marcas de inserci&oacute;n de c&oacute;digo permitidas en PHP.</p>
     </td>
  </tr>

</table>
<p>Recordar que los estilos permitidos eran: SGML, XML, SCRIPT y ASP, donde los estilos SGML y ASP permiten una versi&oacute;n reducida de la sentencia <tt>echo</tt>.</p>

<table class='box'>
  <tr valign='top'>
    <td><img src="../../images/icons/info.png"></td>
    <td width='99%'>
      <p>La instalaci&oacute;n de PHP realizada en el laboratorio podr&iacute;a tener algunas de las marcas deshabilitadas en su configuraci&oacute;n.</p>
     </td>
  </tr>

</table>

<table class='box'>
  <tr valign='top'>
    <td><img src="../../images/icons/run.png"></td>
    <td width='99%'>
      <p>Probar su funcionamiento pinchando en el siguiente enlace: <a href="../../02-lenguaje-php/ficheros/prueba.php" target="files"></tt>prueba.php</tt></a></p>
     </td>
  </tr>

</table>
<p>Las marcas de inserci&oacute;n de c&oacute;digo que no est&eacute;n habilitadas normalmente quedar&aacute;n sin procesar y aparecer&aacute; el c&oacute;digo PHP en el fichero HTML que se le pase al navegador, el cual tambi&eacute;n las ignorar&aacute;. Comprobadlo viendo el c&oacute;digo HTML generado con ayuda del navegador.</p>

<table class='box'>
  <tr valign='top'>
    <td><img src="../../images/icons/info.png"></td>
    <td width='99%'>
      <p>El c&oacute;digo fuente se puede obtener pulsando el bot&oacute;n derecho sobre el navegador y escogiendo la opci&oacute;n <i>Ver c&oacute;digo fuente de la p&aacute;gina</i>.</p>
     </td>
  </tr>

</table>
    <!-- END CONTENTS -->
    </td>
  </tr>
  <tr>
    <td>
      <div class='pagebar'>
        <span class='pageindex'>
          2 / 7        </span>
        <span class='pagelink'>
          <a href="02-lenguaje-php-ejer.html">[&lArr;]</a>
        </span>
        <span class='pagelink'>
          <a href="page-02.html">[&rArr;]</a>
        </span>
      </div>
    </td>
  </tr>
</table>
